In [34]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt

a=[[1,2,3],[4,5,6],[7,8,np.nan]]
df1=pd.DataFrame(np.array(a),columns=['a','b','c'])
df1

     a    b    c
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  NaN

#### 增加记录

In [7]:
df1.append([[21,22,23]])#里面那个行 会转化为df 然后再接一起

     a    b    c     0     1     2
0  1.0  2.0  3.0   NaN   NaN   NaN
1  4.0  5.0  6.0   NaN   NaN   NaN
2  7.0  8.0  NaN   NaN   NaN   NaN
0  NaN  NaN  NaN  21.0  22.0  23.0

In [ ]:
df.append(df) #会自动对齐行标，列标

In [33]:
# df append df法
pd.DataFrame([[21,22,23]],columns=df1.columns) #记得创建要二维

    a   b   c
0  21  22  23

In [37]:
# df append 字典法
df2 = df1.append({'a':10,'b':11,'c':12}, ignore_index=True)# 添加的这个行没有index  也就是3，所以要ignore_index
df2

      a     b     c
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2   7.0   8.0   NaN
3  10.0  11.0  12.0

In [ ]:
# 方法三：先取出来变成list，然后再转会df

In [18]:
# 方法四 像字典一样给新key

In [24]:
df1

     a    b    c
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  NaN

In [26]:
df1[3]=[6,7,8] #新列
df1

     a    b    c  3
0  1.0  2.0  3.0  6
1  4.0  5.0  6.0  7
2  7.0  8.0  NaN  8

In [29]:
# 新行
df1.loc[3,:]=[4,5,6,7]#所以这个列表不用做成行或者列，只要理解为一个容器就行，df需要多少个数，容器里就有多少个数就行
df1

     a    b    c    3
0  1.0  2.0  3.0  6.0
1  4.0  5.0  6.0  7.0
2  7.0  8.0  NaN  8.0
3  4.0  5.0  6.0  7.0

#### 删除

In [ ]:
# 删除行和列
# del df1['birth'] #删除列
# df.drop(['ID'],axis=1,inplace=True) #删除列 0是横方向，1是列  inplace=False)将不改变原来的dataFrame，而将结果生成在一个新的dataFrame中。
# df.drop([0,1,2,3],axis=0) #删除行

In [ ]:
# a=a.drop_duplicates(subset=['代码'])  # 删除重复的行

In [ ]:
# a=a.dropna(how='all')    # 把series中值为nan的值去掉

#### 修改

In [3]:
# 可以局部赋值  可以修改一个值
a=[[1,2,3],[4,5,6],[7,8,np.nan]]
df2=pd.DataFrame(np.array(a),columns=['a','b','c'])
df2

     a    b    c
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  NaN

In [4]:
df2.loc[2,'c']=99

In [5]:
df2

     a    b     c
0  1.0  2.0   3.0
1  4.0  5.0   6.0
2  7.0  8.0  99.0

In [7]:
df2.loc[:,'a']=df2.loc[:,'c'] #将一列赋值给另一列
df2

      a    b     c
0   3.0  2.0   3.0
1   6.0  5.0   6.0
2  99.0  8.0  99.0

In [9]:
df2.loc[[0,1],'b']=df2.loc[[1,2],'c']#会对着行标赋值的

In [10]:
df2

      a    b     c
0   3.0  NaN   3.0
1   6.0  6.0   6.0
2  99.0  8.0  99.0

In [3]:
import pandas as pd

In [14]:
a=pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
b=pd.Series([1,2,3,4,5],index=[4,3,2,1,0])
b

4    1
3    2
2    3
1    4
0    5
dtype: int64

In [12]:
a=b

4    1
3    2
2    3
1    4
0    5
dtype: int64